---
kind: other
id: Properties.T:Autodesk.Revit.Creation.ItemFactoryBase
source: html/d27aac1c-e9ef-5a02-5003-69fbfd12d8d0.htm
---
# ItemFactoryBase Properties

Identifies if the object is read-only or modifiable.